of2306/buoyantSimpleFoam/simpleCarSolarPanel/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(solarpanel.*|ref_wall|YMax|YMin|XMax|XMin|ZMin)"
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    ZMax
    {
        type            prghTotalPressure;
        p0              $internalField;
    }
}


// ************************************************************************* //
